{
  "hi": "Hello! How can I assist you today?",
  "hello": "Hi there! Welcome to KLS VDIT. What can I do for you?",
  "ok": "Great!",
  "What is the college name?": "KLS Vishwanathrao Deshpande Institute of Technology, Haliyal.",
  "Where is the college located?": "Udyog Vidya Nagar, Dandeli Rd, Haliyal, Karnataka 581329.",
  "what are the college timings?": "The college operates from 9 AM to 4 PM, Monday to Saturday. Except first and third Saturday. ",
  "how can i access library resources?": "Visit the library or can access through digital library.",
  "what is the address of college?": "Karnatak Law Society's, Vishwanathrao Deshpande Institute of Technology, Udyog Vidya Nagar, Dandeli Rd, Haliyal, Karnataka 581329",
  "who is the principal of the college?": "The principal of KLS VDIT is Dr.V A Kulkarni.",
  "how can i contact the college office?": "You can reach the office at 082842 20861 or email us at principal@klsvdit.edu.in.",
  "what courses are offered?": "We offer BE programs in Computer Science, Mechanical Engineering, Civil Engineering, Electronics, Electrical and AIML.",
  "is hostel facility available?": "Yes, we have separate hostels for boys and girls with modern amenities.",
  "how to pay fees?": "You can pay fees online through the college portal or directly at the office.",
  "when are the exams conducted?": "Exams are conducted as per the university calendar.",
  "how can i get my hall ticket?": "Hall tickets will be provided by the respective department. Please ensure all dues are cleared.",
  "what extracurricular activities are available?": "We have sports, cultural clubs, coding clubs, robotics, and various other extracurricular activities.",
  "how can i join a club?": "Contact the club coordinator or attend the induction sessions held at the start of each semester.",
  "what is the dress code?": "Students must wear formal attire or decent casual wear.",
  "who can help with placement queries?": "Reach out to the Placement Cell located on the ground floor or email placement@klsvdit.edu.in.",
  "what is the attendance requirement?": "You need a minimum of 85% attendance in all subjects to appear for exams.",
  "how can i raise a grievance?": "The institution has a Grievance cell to address the problems of students.Contact- Dr. Poornima Raikar:9611517345/Dr. Naveenkumar Rudrappa-9481769030.",
  "where can i find the timetable?": "The timetable is displayed on the department notice board and uploaded to the student portal.",
  "how can i get a bonafide certificate?": "Submit a request form at the office. It will be issued within two working days.",
  "what events are conducted in the college?": "We conduct technical fests, cultural events, hackathons, sports meets, and more throughout the year.",
  "is there Wi-Fi on campus?": "Yes, Wi-Fi is available for students and staff. Contact the IT department for login credentials.",
  "where can i find the medical facility?": "The medical facility is located near the hostel block, and first aid kits are available in all departments.",
  "how can i participate in sports?": "Contact the sports coordinator or visit the sports office for registration and practice schedules.",
  "what is the procedure for document verification?": "Submit the required documents to the admin office for verification. Processing takes 3-5 working days.",
  "how can i join the alumni association?": "Register on the alumni portal available on the college website.",
  "what are the hostel rules?": "Hostel rules include maintaining discipline, following curfews, and no unauthorized visitors. Detailed rules are in the hostel handbook.",
  "what are the available bus routes?": "Bus routes cover major areas in and around Dharwad, Hubli, belagavi, Dandeli, Alnavar.",
  "how can i access the research lab?": "Contact your department head to get access permissions for the research lab.",
  "can i take books home from the library?": "Yes, you can borrow books with your ID card. Return them within the due date to avoid fines.",
  "what is the procedure to change my branch?": "Branch change is subject to university guidelines and approval. Contact the academic coordinator for details.",
  "how can i participate in technical fests?": "Register online or through your department. Look out for announcements on the notice board.",
  "how to update my contact details in college records?": "Submit a request with updated information at the admin office.",
  "what are the training programs offered by the placement cell?": "The placement cell offers aptitude training, soft skills workshops, and technical interview preparation sessions.",
  "how can i submit assignments?": "Submit assignments directly to your subject teacher by the due date.",
  "what is the grading system?": "Grades are based on a 10-point CGPA system as per university norms.",
  "how can i apply for an internship?": "Contact training and placement officer.",
  "how many students are currently studying in your college?": "1200+ Students study at KLS VDIT.",
  "In which year college was Established?": "2004.",
  "How many faculty members does your college have?": "100+.",
  "how many Non-teaching members does your college have?": "150+.",
  "How many students have graduated from this college so far?": "7000+.",
  "What is the total campus area of the college in acres?": "26.",
  "How many undergraduate courses does the college offer?": "6.",
  "What are the postgraduate courses does the college offer?": "Industrial Electronics,Thermal Power Engineering.",
  "Who is the HOD of Computer Science and Engineering?": "Dr. Venkatesh Shankar.",
  "Who is the HOD of Artificial intelligence and machine learning(AIML)?": "Dr. Poornima Raikar.",
  "Who is the HOD of Electronics and Communication Engineering(ECE)?": "Dr. Mahendra Dixit.",
  "Who is the HOD of Electrical and Electronics Engineering(EEE)?": "Prof. Rajeshwari N.",
  "Who is the HOD of Mechanical Engineering(ME)?": "Dr.Kallappa S. Pujari.",
  "Who is the HOD of Civil Engineering(CV)?": "Dr. A. C. Bellary.",
  "What is the total number of reference books in the library?": "7000 +.",
  "How many volumes are available in the library?": "over 44000 volumes.",
  "How many titles are included in the library's collection?": "6212 titles.",
  "Are there research opportunities at KLS VDIT?": "Yes, the institute emphasizes research and innovation through its Research & IPR cell and centers of excellence. It also facilitates    participation in industry-sponsored projects​.",
  "What is the placement percentage for the academic year 2021-2022?": "The placement percentage for 2021-22 was approximately 63%, with 242 out of 384 graduating students placed.",
  "How many students were placed in 2020-2021, and what was the median salary offered?": " In 2020-2021, 182 students out of 349 graduates were placed. The median salary offered was ₹4.10 LPA.",
  "What is the placement percentage for 2023?": "For 2023, the placement percentage was 37.22%, with 131 out of 353 students placed.",
  "What is the median salary for 2023 placements?": "The median salary for 2023 placements was ₹3.15 LPA.",
  "Which major companies visit KLS VDIT for recruitment?": " Companies like TCS, Infosys, Cognizant, Wipro, and Mindtree are among the regular recruiters at KLS VDIT",
  "What kind of companies visit the campus for recruitment?": "Companies from various sectors like IT, Manufacturing, Finance, and Consulting visit the campus for recruitment drives. These include well-known firms such as TCS, Infosys, Wipro, and others.",
  "What is the vision of the college?": "To nurture talent and enrich society through excellence in technical education, research and innovation.",
  "What is the mission of the college?": "1.To augment innovative Pedagogy, kindle quest for interdisciplinary learning & to enhance conceptual understanding.2.To build competence, professional ethics & develop entrepreneurial thinking.3.To strengthen Industry Institute Partnership & explore global collaborations.4.To inculcate culture of socially responsible citizenship.5.To focus on Holistic & Sustainable development.",
  "What facilities are available on campus?": "The campus offers various facilities such as libraries, sports, hostels, transportation, and a variety of centers for technical learning like the NPTEL Learning Center and the K-Tech NAIN Center."
}